namespace JudgesTournament.Domain.Constants;

public static class Governorates
{
    public static readonly IReadOnlyList<string> All =
    [
        "القاهرة",
        "الجيزة",
        "الإسكندرية",
        "الدقهلية",
        "الشرقية",
        "المنوفية",
        "القليوبية",
        "البحيرة",
        "الغربية",
        "كفر الشيخ",
        "دمياط",
        "بورسعيد",
        "الإسماعيلية",
        "السويس",
        "شمال سيناء",
        "جنوب سيناء",
        "الفيوم",
        "بني سويف",
        "المنيا",
        "أسيوط",
        "سوهاج",
        "قنا",
        "الأقصر",
        "أسوان",
        "البحر الأحمر",
        "الوادي الجديد",
        "مطروح"
    ];
}
